app/Controllers/User.php

    public function login()
    {
        $session = session();

        $user_obj = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $user_obj->where('email', $email)->first();

        if($data){
            $pass = $data['clave'];
            $authenticatePassword = password_verify($password, $pass);
            if($authenticatePassword){

                $acceso = [
                    'idUsuario' => $data['id'],
                    'fecha'=> date('Y-m-d H:i:s'),
                ];

                $acceso_obj = new AccesoModel();
                $acceso_obj->insert($acceso);
---
INSERT INTO `accesos` (`idUsuario`, `fecha`) VALUES ('3', '2022-06-15 19:31:54')